/*
题目描述
一只青蛙一次可以跳上1级台阶，也可以跳上2级……它也可以跳上n级。求该青蛙跳上一个n级的台阶总共有多少种跳法。
直球，显然f(n) = f(n-1) + f(n-2) + f(n-3) + ... f(3) + f(2) + f(1) +f(0)
顺便可得f(0) = 1，即一次跳完全程的跳法，但是单独的f(0)无意义。剩下的与普通跳法大同小异
再展开一个f(n-1)的式子，f(n) - f(n-1)可得：f(n) = 2*f(n-1), f(0) = 1, f(1) = 1, f(2) = 2。
这里已经可以写程序了，但是继续化简，f(n) = 2*f(n-1) = 4*f(n-2) = ... = 2^(n-1)。为什么不缩减到f(0)？因为f(0)本身无意义，且f(-1)超出函数定义域了。
*/
#include <stdio.h>
#include <math.h>

long jump(int n) {
    long res = 0;
    if (n <= 2) return (long)n;
    return pow(2, (n-1));
}

int main () {
    printf("%ld\n", jump(30));
    return 0;
}
